bench-results/fan-3host-20260601T011018Z/oldA/fan-run/fio-randread-32lane.txt
fan32-randread: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=io_uring, iodepth=64
...
fio-3.36
Starting 64 processes

fan32-randread: (groupid=0, jobs=64): err= 0: pid=192732: Mon Jun  1 01:11:29 2026
  read: IOPS=28.0k, BW=109MiB/s (115MB/s)(576MiB/5260msec)
    slat (nsec): min=1418, max=477571, avg=3616.63, stdev=1882.25
    clat (usec): min=774, max=490506, avg=142984.40, stdev=61982.98
     lat (usec): min=782, max=490510, avg=142988.02, stdev=61983.02
    clat percentiles (msec):
     |  1.00th=[   16],  5.00th=[   38], 10.00th=[   56], 20.00th=[   82],
     | 30.00th=[  110], 40.00th=[  131], 50.00th=[  146], 60.00th=[  165],
     | 70.00th=[  184], 80.00th=[  201], 90.00th=[  218], 95.00th=[  232],
     | 99.00th=[  259], 99.50th=[  300], 99.90th=[  422], 99.95th=[  439],
     | 99.99th=[  472]
   bw (  KiB/s): min=95831, max=139563, per=100.00%, avg=114648.70, stdev=262.25, samples=640
   iops        : min=23954, max=34887, avg=28660.70, stdev=65.56, samples=640
  lat (usec)   : 1000=0.04%
  lat (msec)   : 2=0.22%, 4=0.14%, 10=0.31%, 20=0.46%, 50=7.27%
  lat (msec)   : 100=16.02%, 250=73.74%, 500=1.80%
  cpu          : usr=0.04%, sys=0.32%, ctx=143391, majf=0, minf=4510
  IO depths    : 1=0.1%, 2=0.1%, 4=0.2%, 8=0.3%, 16=0.7%, 32=1.4%, >=64=97.3%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=147374,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=109MiB/s (115MB/s), 109MiB/s-109MiB/s (115MB/s-115MB/s), io=576MiB (604MB), run=5260-5260msec

Disk stats (read/write):
  zcnblk0: ios=145944/0, sectors=1167552/0, merge=0/0, ticks=20549411/0, in_queue=20549411, util=97.52%