bench-results/fan-3host-20260601T011018Z/oldA/fan-run/fio-randwrite-32lane.txt
fan32-randwrite: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=io_uring, iodepth=64
...
fio-3.36
Starting 64 processes

fan32-randwrite: (groupid=0, jobs=64): err= 0: pid=193088: Mon Jun  1 01:11:53 2026
  write: IOPS=46.6k, BW=182MiB/s (191MB/s)(936MiB/5146msec); 0 zone resets
    slat (nsec): min=898, max=94703, avg=4386.33, stdev=1655.09
    clat (usec): min=649, max=277624, avg=87066.21, stdev=34322.38
     lat (usec): min=660, max=277628, avg=87070.60, stdev=34322.56
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[   32], 10.00th=[   42], 20.00th=[   59],
     | 30.00th=[   69], 40.00th=[   78], 50.00th=[   88], 60.00th=[   96],
     | 70.00th=[  107], 80.00th=[  117], 90.00th=[  131], 95.00th=[  140],
     | 99.00th=[  163], 99.50th=[  182], 99.90th=[  224], 99.95th=[  236],
     | 99.99th=[  266]
   bw (  KiB/s): min=149154, max=246187, per=100.00%, avg=188497.90, stdev=578.86, samples=640
   iops        : min=37288, max=61544, avg=47123.70, stdev=144.71, samples=640
  lat (usec)   : 750=0.02%, 1000=0.20%
  lat (msec)   : 2=0.74%, 4=0.69%, 10=0.70%, 20=0.48%, 50=9.40%
  lat (msec)   : 100=51.82%, 250=35.93%, 500=0.03%
  cpu          : usr=0.10%, sys=0.62%, ctx=235262, majf=0, minf=426
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.2%, 16=0.4%, 32=0.9%, >=64=98.3%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=0,239658,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=182MiB/s (191MB/s), 182MiB/s-182MiB/s (191MB/s-191MB/s), io=936MiB (982MB), run=5146-5146msec

Disk stats (read/write):
  zcnblk0: ios=0/239448, sectors=0/1915584, merge=0/0, ticks=0/20649454, in_queue=20649455, util=97.50%